heat-exchanger-simplified/fluid1-openfoam/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 103500;

boundaryField
{
    interface
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    top
    {
        type            zeroGradient;
    }
    slip-bottom
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
}
