heat-exchanger-simplified/fluid1-openfoam/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    interface
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    inlet
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    outlet
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    top
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    bottom
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    slip-bottom
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    defaultFaces
    {
        type            empty;
    }
}
