heat-exchanger-simplified/fluid1-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid1;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Fluid1-Mesh;
    patches           (interface);
    
    readData
    (
      Heat-Flux1
    );
    
    writeData
    (
      Temperature1
    );
  };
};
